TaLucGiaHoang/SW-TM4C/TivaWare_C_Series-2.1.4.178/sensorlib/hw_mpu9150.h
//*****************************************************************************
//
// hw_mpu9150.h - Macros used when accessing the Invensense MPU9150
//                accelerometer/gyroscope/magnetometer.
//
// Copyright (c) 2013-2017 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.1.4.178 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#ifndef __SENSORLIB_HW_MPU9150_H__
#define __SENSORLIB_HW_MPU9150_H__

//*****************************************************************************
//
// The following are defines for the MPU9150 register addresses.
//
//*****************************************************************************
#define MPU9150_O_SELF_TEST_X   0x0D        // Self test X register
#define MPU9150_O_SELF_TEST_Y   0x0E        // Self test Y register
#define MPU9150_O_SELF_TEST_Z   0x0F        // Self test Z register
#define MPU9150_O_SELF_TEST_A   0x10        // Self test A register
#define MPU9150_O_SMPLRT_DIV    0x19        // Sample rate divider register
#define MPU9150_O_CONFIG        0x1A        // Configuration register
#define MPU9150_O_GYRO_CONFIG   0x1B        // Gyro configuration register
#define MPU9150_O_ACCEL_CONFIG  0x1C        // Accelerometer configuration
                                            // register
#define MPU9150_O_FF_THR        0x1D        // Free-fall threshold register
#define MPU9150_O_FF_DUR        0x1E        // Free-fall duration register
#define MPU9150_O_MOT_THR       0x1F        // Motion detection threshold
                                            // register
#define MPU9150_O_MOT_DUR       0x20        // Motion detection duration
                                            // register
#define MPU9150_O_ZRMOT_THR     0x21        // Zero motion detection threshold
                                            // register
#define MPU9150_O_ZRMOT_DUR     0x22        // Zero motion detection duration
                                            // register
#define MPU9150_O_FIFO_EN       0x23        // FIFO enable register
#define MPU9150_O_I2C_MST_CTRL  0x24        // I2C master control register
#define MPU9150_O_I2C_SLV0_ADDR 0x25        // I2C slave 0 address register
#define MPU9150_O_I2C_SLV0_REG  0x26        // I2C slave 0 register number
                                            // register
#define MPU9150_O_I2C_SLV0_CTRL 0x27        // I2C slave 0 control register
#define MPU9150_O_I2C_SLV1_ADDR 0x28        // I2C slave 1 address register
#define MPU9150_O_I2C_SLV1_REG  0x29        // I2C slave 1 register number
                                            // register
#define MPU9150_O_I2C_SLV1_CTRL 0x2A        // I2C slave 1 control register
#define MPU9150_O_I2C_SLV2_ADDR 0x2B        // I2C slave 2 address register
#define MPU9150_O_I2C_SLV2_REG  0x2C        // I2C slave 2 register number
                                            // register
#define MPU9150_O_I2C_SLV2_CTRL 0x2D        // I2C slave 2 control register
#define MPU9150_O_I2C_SLV3_ADDR 0x2E        // I2C slave 3 address register
#define MPU9150_O_I2C_SLV3_REG  0x2F        // I2C slave 3 register number
                                            // register
#define MPU9150_O_I2C_SLV3_CTRL 0x30        // I2C slave 3 control register
#define MPU9150_O_I2C_SLV4_ADDR 0x31        // I2C slave 4 address register
#define MPU9150_O_I2C_SLV4_REG  0x32        // I2C slave 4 register number
                                            // register
#define MPU9150_O_I2C_SLV4_DO   0x33        // I2C slave 4 output data register
#define MPU9150_O_I2C_SLV4_CTRL 0x34        // I2C slave 4 control register
#define MPU9150_O_I2C_SLV4_DI   0x35        // I2C slave 4 input data register
#define MPU9150_O_I2C_MST_STATUS                                              \
                                0x36        // I2C master status register
#define MPU9150_O_INT_PIN_CFG   0x37        // INT pin configuration register
#define MPU9150_O_INT_ENABLE    0x38        // Interrupt enable register
#define MPU9150_O_INT_STATUS    0x3A        // Interrupt status register
#define MPU9150_O_ACCEL_XOUT_H  0x3B        // X-axis acceleration data MSB
                                            // register
#define MPU9150_O_ACCEL_XOUT_L  0x3C        // X-axis acceleration data LSB
                                            // register
#define MPU9150_O_ACCEL_YOUT_H  0x3D        // Y-axis acceleration data MSB
                                            // register
#define MPU9150_O_ACCEL_YOUT_L  0x3E        // Y-axis accelearation data LSB
                                            // register
#define MPU9150_O_ACCEL_ZOUT_H  0x3F        // Z-axis acceleration data MSB
                                            // register
#define MPU9150_O_ACCEL_ZOUT_L  0x40        // Z-axis acceleration data LSB
                                            // register
#define MPU9150_O_TEMP_OUT_H    0x41        // Temperature data MSB register
#define MPU9150_O_TEMP_OUT_L    0x42        // Temperature data LSB register
#define MPU9150_O_GYRO_XOUT_H   0x43        // X-axis gyro data MSB register
#define MPU9150_O_GYRO_XOUT_L   0x44        // X-axis gyro data LSB register
#define MPU9150_O_GYRO_YOUT_H   0x45        // Y-axis gyro data MSB register
#define MPU9150_O_GYRO_YOUT_L   0x46        // Y-axis gyro data LSB register
#define MPU9150_O_GYRO_ZOUT_H   0x47        // Z-axis gyro data MSB register
#define MPU9150_O_GYRO_ZOUT_L   0x48        // Z-axis gyro data LSB register
#define MPU9150_O_EXT_SENS_DATA_00                                            \
                                0x49        // External sensor data 0 register
#define MPU9150_O_EXT_SENS_DATA_01                                            \
                                0x4A        // External sensor data 1 register
#define MPU9150_O_EXT_SENS_DATA_02                                            \
                                0x4B        // External sensor data 2 register
#define MPU9150_O_EXT_SENS_DATA_03                                            \
                                0x4C        // External sensor data 3 register
#define MPU9150_O_EXT_SENS_DATA_04                                            \
                                0x4D        // External sensor data 4 register
#define MPU9150_O_EXT_SENS_DATA_05                                            \
                                0x4E        // External sensor data 5 register
#define MPU9150_O_EXT_SENS_DATA_06                                            \
                                0x4F        // External sensor data 6 register
#define MPU9150_O_EXT_SENS_DATA_07                                            \
                                0x50        // External sensor data 7 register
#define MPU9150_O_EXT_SENS_DATA_08                                            \
                                0x51        // External sensor data 8 register
#define MPU9150_O_EXT_SENS_DATA_09                                            \
                                0x52        // External sensor data 9 register
#define MPU9150_O_EXT_SENS_DATA_10                                            \
                                0x53        // External sensor data 10 register
#define MPU9150_O_EXT_SENS_DATA_11                                            \
                                0x54        // External sensor data 11 register
#define MPU9150_O_EXT_SENS_DATA_12                                            \
                                0x55        // External sensor data 12 register
#define MPU9150_O_EXT_SENS_DATA_13                                            \
                                0x56        // External sensor data 13 register
#define MPU9150_O_EXT_SENS_DATA_14                                            \
                                0x57        // External sensor data 14 register
#define MPU9150_O_EXT_SENS_DATA_15                                            \
                                0x58        // External sensor data 15 register
#define MPU9150_O_EXT_SENS_DATA_16                                            \
                                0x59        // External sensor data 16 register
#define MPU9150_O_EXT_SENS_DATA_17                                            \
                                0x5A        // External sensor data 17 register
#define MPU9150_O_EXT_SENS_DATA_18                                            \
                                0x5B        // External sensor data 18 register
#define MPU9150_O_EXT_SENS_DATA_19                                            \
                                0x5C        // External sensor data 19 register
#define MPU9150_O_EXT_SENS_DATA_20                                            \
                                0x5D        // External sensor data 20 register
#define MPU9150_O_EXT_SENS_DATA_21                                            \
                                0x5E        // External sensor data 21 register
#define MPU9150_O_EXT_SENS_DATA_22                                            \
                                0x5F        // External sensor data 22 register
#define MPU9150_O_EXT_SENS_DATA_23                                            \
                                0x60        // External sensor data 23 register
#define MPU9150_O_MOT_DETECT_STATUS                                           \
                                0x61        // Motion detection status register
#define MPU9150_O_I2C_SLV0_DO   0x63        // I2C slave 0 output data register
#define MPU9150_O_I2C_SLV1_DO   0x64        // I2C slave 1 output data register
#define MPU9150_O_I2C_SLV2_DO   0x65        // I2C slave 2 output data register
#define MPU9150_O_I2C_SLV3_DO   0x66        // I2C slave 3 output data register
#define MPU9150_O_I2C_MST_DELAY_CTRL                                          \
                                0x67        // I2C master delay control
                                            // register
#define MPU9150_O_SIGNAL_PATH_RESET                                           \
                                0x68        // Signal path reset register
#define MPU9150_O_MOT_DETECT_CTRL                                             \
                                0x69        // Motion detection control
                                            // register
#define MPU9150_O_USER_CTRL     0x6A        // User control register
#define MPU9150_O_PWR_MGMT_1    0x6B        // Power management 1 register
#define MPU9150_O_PWR_MGMT_2    0x6C        // Power management 2 register
#define MPU9150_O_FIFO_COUNTH   0x72        // FIFO count MSB register
#define MPU9150_O_FIFO_COUNTL   0x73        // FIFO count LSB register
#define MPU9150_O_FIFO_R_W      0x74        // FIFO read write register
#define MPU9150_O_WHO_AM_I      0x75        // Who am I register

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_SELF_TEST_X
// register.
//
//*****************************************************************************
#define MPU9150_SELF_TEST_X_XA_TEST_M                                         \
                                0xE0        // Accelerometer XA_TEST[4:2]
#define MPU9150_SELF_TEST_X_XG_TEST_M                                         \
                                0x1F        // Gyro XG_TEST[4:0]
#define MPU9150_SELF_TEST_X_XA_TEST_S                                         \
                                5
#define MPU9150_SELF_TEST_X_XG_TEST_S                                         \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_SELF_TEST_Y
// register.
//
//*****************************************************************************
#define MPU9150_SELF_TEST_Y_YA_TEST_M                                         \
                                0xE0        // Accelerometer YA_TEST[4:2]
#define MPU9150_SELF_TEST_Y_YG_TEST_M                                         \
                                0x1F        // Gyro YG_TEST[4:0]
#define MPU9150_SELF_TEST_Y_YA_TEST_S                                         \
                                5
#define MPU9150_SELF_TEST_Y_YG_TEST_S                                         \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_SELF_TEST_Z
// register.
//
//*****************************************************************************
#define MPU9150_SELF_TEST_Z_ZA_TEST_M                                         \
                                0xE0        // Accelerometer ZA_TEST[4:2]
#define MPU9150_SELF_TEST_Z_ZG_TEST_M                                         \
                                0x1F        // Gyro ZG_TEST[4:0]
#define MPU9150_SELF_TEST_Z_ZA_TEST_S                                         \
                                5
#define MPU9150_SELF_TEST_Z_ZG_TEST_S                                         \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_SELF_TEST_A
// register.
//
//*****************************************************************************
#define MPU9150_SELF_TEST_A_XA_TEST_M                                         \
                                0x30        // Accelerometer XA_TEST[1:0]
#define MPU9150_SELF_TEST_A_YA_TEST_M                                         \
                                0x0C        // Accelerometer YA_TEST[1:0]
#define MPU9150_SELF_TEST_A_ZA_TEST_M                                         \
                                0x03        // Accelerometer ZA_TEST[1:0]
#define MPU9150_SELF_TEST_A_XA_TEST_S                                         \
                                4
#define MPU9150_SELF_TEST_A_YA_TEST_S                                         \
                                2
#define MPU9150_SELF_TEST_A_ZA_TEST_S                                         \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_SMPLRT_DIV
// register.
//
//*****************************************************************************
#define MPU9150_SMPLRT_DIV_M    0xFF        // Gyro output rate divider
#define MPU9150_SMPLRT_DIV_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_CONFIG
// register.
//
//*****************************************************************************
#define MPU9150_CONFIG_EXT_SYNC_SET_M                                         \
                                0x38        // FSYNC pin sample location
#define MPU9150_CONFIG_EXT_SYNC_SET_DIS                                       \
                                0x00        // FSYNC input disabled
#define MPU9150_CONFIG_EXT_SYNC_SET_TEMP_OUT_L                                \
                                0x08        // FSYNC on TEMP_OUT_L[0]
#define MPU9150_CONFIG_EXT_SYNC_SET_GYRO_XOUT_L                               \
                                0x10        // FSYNC on GYRO_XOUT_L[0]
#define MPU9150_CONFIG_EXT_SYNC_SET_GYRO_YOUT_L                               \
                                0x18        // FSYNC on GYRO_YOUT_L[0]
#define MPU9150_CONFIG_EXT_SYNC_SET_GYRO_ZOUT_L                               \
                                0x20        // FSYNC on GYRO_ZOUT_L[0]
#define MPU9150_CONFIG_EXT_SYNC_SET_ACCEL_XOUT_L                              \
                                0x28        // FSYNC on ACCEL_XOUT_L[0]
#define MPU9150_CONFIG_EXT_SYNC_SET_ACCEL_YOUT_L                              \
                                0x30        // FSYNC on ACCEL_YOUT_L[0]
#define MPU9150_CONFIG_EXT_SYNC_SET_ACCEL_ZOUT_L                              \
                                0x38        // FSYNC on ACCEL_ZOUT_L[0]
#define MPU9150_CONFIG_DLPF_CFG_M                                             \
                                0x07        // Digital low-pass filter
                                            // configuration
#define MPU9150_CONFIG_DLPF_CFG_260_256                                       \
                                0x00        // 260 Hz accelerometer bandwidth,
                                            // 256 Hz gyro bandwidth
#define MPU9150_CONFIG_DLPF_CFG_184_188                                       \
                                0x01        // 184 Hz accelerometer bandwidth,
                                            // 188 Hz gyro bandwidth
#define MPU9150_CONFIG_DLPF_CFG_94_98                                         \
                                0x02        // 94 Hz accelerometer bandwidth,
                                            // 98 Hz gyro bandwidth
#define MPU9150_CONFIG_DLPF_CFG_44_42                                         \
                                0x03        // 44 Hz accelerometer bandwidth,
                                            // 42 Hz gyro bandwidth
#define MPU9150_CONFIG_DLPF_CFG_21_20                                         \
                                0x04        // 21 Hz accelerometer bandwidth,
                                            // 20 Hz gyro bandwidth
#define MPU9150_CONFIG_DLPF_CFG_10_10                                         \
                                0x05        // 10 Hz accelerometer bandwidth,
                                            // 10 Hz gyro bandwidth
#define MPU9150_CONFIG_DLPF_CFG_5_5                                           \
                                0x06        // 5 Hz accelerometer bandwidth, 5
                                            // Hz gyro bandwidth
#define MPU9150_CONFIG_EXT_SYNC_SET_S                                         \
                                3
#define MPU9150_CONFIG_DLPF_CFG_S                                             \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU9150_O_GYRO_CONFIG
// register.
//
//*****************************************************************************
#define MPU9150_GYRO_CONFIG_XG_ST                                             \
                                0x80        // X-axis gyro self-test enable
#define MPU9150_GYRO_CONFIG_YG_ST                                             \
                                0x40        // Y-axis gyro self-test enable
#define MPU9150_GYRO_CONFIG_ZG_ST                                             \
                                0x20        // Z-axis gyro self-test enable
#define MPU9150_GYRO_CONFIG_FS_SEL_M                                          \
                                0x18        // Gyro full-scale range
#define MPU9150_GYRO_CONFIG_FS_SEL_250                                        \
                                0x00        // Gyro full-scale range +/- 250
                                            // degrees/sec
#define MPU9150_GYRO_CONFIG_FS_SEL_500                                        \
                                0x08        // Gyro full-scale range +/- 500
                                            // degrees/sec
#define MPU9150_GYRO_CONFIG_FS_SEL_1000                                       \
                                0x10        // Gyro full-scale range +/- 1000
                                            // degrees/sec
#define MPU9150_GYRO_CONFIG_FS_SEL_2000                                       \
                                0x18        // Gyro full-scale range +/- 2000
                                            // degrees/sec
#define MPU9150_GYRO_CONFIG_FS_SEL_S                                          \
                                3

